# Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:

# 1) с помощью математических формул нахождения корней квадратного уравнения

# 2) с помощью дополнительных библиотек Python

import math
a = float(input('input A: '))
b = float(input('input B: '))
c = float(input('input C: '))

# d = b**2 - 4*a*c
# if d < 0:
#     print('no square root')
# elif d == 0:
#     x = -b / (2*a)
#     print(x)
# else:
#     x1 = (-b + math.sqrt(d)) / (2 * a)
#     x2 = (-b - math.sqrt(d)) / (2 * a)
#     print(x1)
#     print(x2)



